#pragma once
//========================================
// player_k.hpp
//========================================

//----------------------------------------
// PLAYER KIND
//----------------------------------------
enum class PLAYER_KIND {
	  Undef,
	  Alex,		// アレックス:器用な男。
	  Azizi,	// アジジ:マナもある女戦士。
	  Boris,	// ボリス:魔法使い少年。
	  Chani,	// チャニ:賢い女性。
	  Daroou,	// ダルー:毛むくじゃら。
	  Elija,	// イライジャ:顔が黒く、髪と髭がライオンのたてがみのようになっている。
	  Gando,	// ガンドゥ:僧侶風の老人。
	  Gothmog,	// ゴスモグ:黒づくめの魔術師。
	  Halk,		// ハルク:蛮族。
	  Hawk,		// ホーク:マッチョな戦士。
	  Hissssa,	// ヒッサー:蜥蜴人間。
	  Iaido,	// イアイドー:サムライソードを保持
	  Leif,		// リーフ:赤髭。
	  Leyla,	// レイラ:ロープを持っている女。
	  Linflas,	// リンフラス:エルフの男性。
	  Mophus,	// モウファス:複数の食料を持っている禿の老人。
	  Nabi,		// ナビ:賢者風の老人。
	  Sonja,	// ソンヤ:赤髪の女戦士。
	  Stamm,	// スタム:ドワーフの男性。
	  Syra,		// シーラ:エルフの女性。
	  Tiggy,	// ティギー:魔法使い少女。
	  Wu,		// ウー・ツェ:おさげの女。
	  Wuuf,		// ウーフ:狗頭。
	  Zed,		// ゼッド:口ひげを備えた中年男性
};

// End Of File
